Tekla Open API Reference for Tekla Structures 2025
MeshItem Methods
The MeshItem type exposes the following members.
Methods
Name | Description
Export
 Exports the rebar item in the catlog to given file name. If path is not given rebar is exported to model folder. If filename is empty rebar name is used as filename.
Select
 Selects the mesh item in the mesh database.
Top
See Also
Reference
MeshItem Class
Tekla.Structures.Catalogs Namespace